In [28]:
# importing dependencies
import pandas as pd

#mysql toolkit
import pymysql #adaptor
from sqlalchemy import create_engine

**Sales Dataset**

In [4]:
# reads sales csv file
sales = pd.read_csv('sales.csv', encoding_errors='ignore')
sales.shape

(10403, 6)

In [5]:
# top 5 rows
sales.head()

   sale_id   sale_date  product_id  customer_id  total  rating
0   2609.0  01-09-2023        24.0          1.0  500.0     5.0
1   2716.0  04-09-2023        24.0          1.0  500.0     4.0
2   3025.0  14-09-2023        24.0          1.0  500.0     5.0
3   3581.0  02-10-2023         4.0          1.0  600.0     5.0
4   4504.0  04-11-2023         5.0          1.0  450.0     4.0

In [6]:
# sales information
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10403 entries, 0 to 10402
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   sale_id      10398 non-null  float64
 1   sale_date    10398 non-null  object
 2   product_id   10398 non-null  float64
 3   customer_id  10398 non-null  float64
 4   total        10398 non-null  float64
 5   rating       10398 non-null  float64
dtypes: float64(5), object(1)
memory usage: 487.8+ KB

In [7]:
# finds duplicates
sales.duplicated().sum()

14

In [8]:
# remove duplicates 
sales.drop_duplicates(inplace=True)

In [9]:
# finds null Values
sales.isnull().sum()

sale_id        1
sale_date      1
product_id     1
customer_id    1
total          1
rating         1
dtype: int64

In [10]:
# droping null values
sales.dropna(inplace=True)

In [ ]:
# saving to original csv file
sales.to_csv('sales.csv', index=False)

**Products Dataset**

In [15]:
# reads products csv file
products = pd.read_csv('products.csv', encoding_errors='ignore')
products.shape

(28, 3)

In [16]:
# top 5 rows
products.head()

   product_id                       product_name price
0           1      Ground Espresso Coffee (250g)  $350
1           2  Cold Brew Coffee Pack (6 Bottles)  $900
2           3       Instant Coffee Powder (100g)  $250
3           4                Coffee Beans (500g)  $600
4           5         Coffee Drip Bags (10 Bags)  $450

In [17]:
# products information 
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    28 non-null     int64
 1   product_name  28 non-null     object
 2   price         28 non-null     object
dtypes: int64(1), object(2)
memory usage: 804.0+ bytes

In [18]:
# replaceing '$' sign and converting price datatype to float
products['price'] = products['price'].str.replace('$', '').astype(float)

In [19]:
# saving in original file
products.to_csv('products.csv', index=False)

**Customers Datasets**

In [20]:
# reads customers csv file
customers = pd.read_csv('customers.csv', encoding_errors='ignore')
customers.shape

(497, 3)

In [21]:
# top 5 rows 
customers.head()

   customer_id  customer_name  city_id
0            1  Aarav Agarwal        1
1            2   Aarav Pandey        1
2            3    Aditi Gupta        1
3            4    Aditi Joshi        1
4            5    Aditi Reddy        1

In [22]:
# customers information
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 497 entries, 0 to 496
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    497 non-null    int64
 1   customer_name  497 non-null    object
 2   city_id        497 non-null    int64
dtypes: int64(2), object(1)
memory usage: 11.8+ KB

In [23]:
#check for duplicates 
customers.duplicated().sum()

0

In [24]:
# check for null values
customers.isnull().sum()

customer_id      0
customer_name    0
city_id          0
dtype: int64

**City Dataset**

In [25]:
# reads city csv file
city = pd.read_csv('city.csv', encoding_errors='ignore')
city.shape

(14, 5)

In [26]:
# top 5 rows
city.head()

   city_id  city_name  population  estimated_rent  city_rank
0        1  Bangalore    12300000           29700          1
1        2    Chennai    11100000           17100          6
2        3       Pune     7500000           15300          9
3        4     Jaipur     4000000           10800          8
4        5      Delhi    31000000           22500          3

In [27]:
# city's information
city.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   city_id         14 non-null     int64
 1   city_name       14 non-null     object
 2   population      14 non-null     int64
 3   estimated_rent  14 non-null     int64
 4   city_rank       14 non-null     int64
dtypes: int64(4), object(1)
memory usage: 692.0+ bytes

**Connecting to MySQL**

In [33]:
# Sql Connection
engine_mysql = create_engine("mysql+pymysql://root:hh123@localhost:3306/mondaycoffee")

try:
    engine_mysql
    print("Connection Successful!")
except:
    print("Unable to connect")

Connection Successful!

**Importing csv files**

In [34]:
# import files into mysql workbench

sales.to_sql(name='sales', con=engine_mysql, index=False)

10388

In [35]:
products.to_sql(name='products', con=engine_mysql, index=False)

28

In [37]:
customers.to_sql(name='customers', con=engine_mysql, index=False)

497

In [38]:
city.to_sql(name='city', con=engine_mysql, index=False)

14